;   ----------------------------------------------------------------------
;               Sample message template file for Golded+
;               Образец файла шаблона сообщения для Golded+
;   ----------------------------------------------------------------------
;
;   ----------------------------------------------------------------------
;   Load language file. / Загрузить языковой файл.
;   ----------------------------------------------------------------------
@LoadLanguage goldlang.rus
;
;   ----------------------------------------------------------------------
;   Insert some hidden lines. / Вставить некоторые скрытые строки.
;   ----------------------------------------------------------------------
;Template: RUSSIAN.TPL
;Realname: Станислав Дёгтев (Stanislav Dyogtev)
;
;   ----------------------------------------------------------------------
;   Insert these lines if the message is a moved reply.
;   Вставить эти строки если сообщение является ответом в другую область.
;   ----------------------------------------------------------------------
@net@Moved*** Ответ на сообщение @OName (@OAddr) @ODate @OTime к @DName (@DAddr).
@echo@Moved*** Ответ на сообщение в конференции @OEcho (@ODesc), написанное @OName (@OAddr) @ODate @OTime к @DName.
@Moved
;
;   ----------------------------------------------------------------------
;   Insert these lines if the message is changed, and not from you.
;   Вставить эти строки если сообщение изменено и не от Вас.
;   ----------------------------------------------------------------------
@Changed*** Изменил: @CName (@CAddr), @CDate @CTime.
@Changed
;
;   ----------------------------------------------------------------------
;   Normal template begins.
;   Начало обычного шаблона.
;   ----------------------------------------------------------------------

   Привет, @TFName!
;
;   ----------------------------------------------------------------------
;   Insert extra empty line in new message (non-reply).
;   Вставить дополнительную пустую строку в новое сообщение (не ответ).
;   ----------------------------------------------------------------------
@New
;
;   ----------------------------------------------------------------------
;   Position cursor for the editor.
;   Позиция курсора для редактора.
;   ----------------------------------------------------------------------
    @Position
;
;   ----------------------------------------------------------------------
;   If we are replying without quoting, add these lines.
;   Если отвечаем без цитирования, добавим эти строки.
;   ----------------------------------------------------------------------
@echo@Reply   Ответ на сообщение @OName (@OAddr), посланное <@ODate> к @DName:
@local@Reply   Ответ на сообщение @OName (@OAddr), посланное <@ODate> к @DName:
@net@Reply   Ответ на сообщение @OName (@OAddr), посланное <@ODate> к @DName (@DAddr):
@Reply@Position
;
;   ----------------------------------------------------------------------
;   If we are comment-replying, add these lines.
;   Если мы комментируем, добавить эти строки.
;   ----------------------------------------------------------------------
@net@Comment Мои добавления и комментарии к сообщению @OName (@OAddr) к @DName (@DAddr), написанному @ODate в @OTime:
@echo@Comment Мои добавления и комментарии к сообщению @OName (@OAddr) к @DName, написанному @ODate в @OTime:
@local@Comment Мои добавления и комментарии к сообщению @OName (@OAddr) к @DName, написанному @ODate в @OTime:
@Comment @Position
;
;   ----------------------------------------------------------------------
;   If we are quote-replying, add these lines.
;   Если мы отвечаем с цитированием, добавить эти строки.
;   ----------------------------------------------------------------------
@net@Quoted    Ответ на сообщение @OName (@OAddr) к @DName (@DAddr), написанное @ODate в @OTime:
@echo@Quoted    Ответ на сообщение @OName (@OAddr) к @DName, написанное @ODate в @OTime:
@local@Quoted    Ответ на сообщение @OName (@OAddr) к @DName, написанное @ODate в @OTime:
@Quoted@Position
;
;   ----------------------------------------------------------------------
;   For the quotebuffer, add these lines.
;   Добавляем эти строки для буфера цитирования.
;   ----------------------------------------------------------------------
@Quotebuf
@net@Quotebuf   Цитирую сообщение @OName (@OAddr) к @DName (@DAddr), написанное @ODate в @OTime:
@echo@Quotebuf   Цитирую сообщение @OName (@OAddr) к @DName, написанное @ODate в @OTime:
@local@Quotebuf   Цитирую сообщение @OName (@OAddr) к @DName, написанное @ODate в @OTime:
@Quotebuf
;
;   ----------------------------------------------------------------------
;   Insert quote of the original message here, if our message is a
;   comment-reply or quote-reply.
;   Если сообщение является комментарием с цитированием или ответом
;   с цитированием, здесь вставлять цитату оригинального сообщения.
;   ----------------------------------------------------------------------
@Quote

;   ----------------------------------------------------------------------
;   Sign the message with your first name and specify ICQ UIN.
;   Подписать сообщение нашим именем и указать номер (UIN) ICQ.
;   ----------------------------------------------------------------------
@CName
ICQ UIN: 24628713
;   ----------------------------------------------------------------------
;   Вставить Куку.
;   ----------------------------------------------------------------------
;@random
;
;   ----------------------------------------------------------------------
;   Insert these lines if the message is forwarded.
;   Вставить эти строки, если сообщение является форвардом.
;   ----------------------------------------------------------------------
@Forward*====Переслал: @CName (@CAddr)===
@Forward* Из конференции : @OEcho (@ODesc)
@Forward* От : @OName, @OAddr (@ODate @OTime)
@net@Forward* К  : @DName, @DAddr
@echo@Forward* К  : @DName
@local@Forward* К  : @DName
@Forward* Тема : @Subject
@Forward*====================================================================
;
;   ----------------------------------------------------------------------
;   If we are forwarding or changing, the original message is inserted
;   here, with the @Message token.
;   Если делаем форвард или изменяем (чужое) сообщение, оригинальное сообщение
;   вставлено здесь, с ключевого слова @Message.
;   ----------------------------------------------------------------------
+ @Message
;
@Forward=====================================================================
@Forward
;   ----------------------------------------------------------------------
;   End of template. Confused? Me too! :-)
;   Конец шаблона. Смущены? Я тоже! :-)
;   ----------------------------------------------------------------------